using-puppet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>using-puppet</title>
<!-- 2015-06-09 화 14:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">using-puppet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. puppet 한번 사용해 볼까 한다</a>
<ul>
<li><a href="#sec-1-1">1.1. 소개글</a></li>
<li><a href="#sec-1-2">1.2. 정보?</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 우선 무슨 일을 하던지 심볼에 대한 정리는 필요하다</a></li>
<li><a href="#sec-3">3. step</a>
<ul>
<li><a href="#sec-3-1">3.1. network configuration @master</a></li>
<li><a href="#sec-3-2">3.2. network configuration @client</a></li>
<li><a href="#sec-3-3">3.3. install puppet master app @master</a></li>
<li><a href="#sec-3-4">3.4. install puppet client app @client</a></li>
<li><a href="#sec-3-5">3.5. generate recipe @master</a></li>
<li><a href="#sec-3-6">3.6. check certificate list @master</a></li>
<li><a href="#sec-3-7">3.7. request about cert @client</a></li>
<li><a href="#sec-3-8">3.8. accept cert @master</a></li>
<li><a href="#sec-3-9">3.9. apply recipe @client</a></li>
<li><a href="#sec-3-10">3.10. case : broken cert</a></li>
</ul>
</li>
<li><a href="#sec-4">4. one more thing</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> puppet 한번 사용해 볼까 한다</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 소개글</h3>
<div class="outline-text-3" id="text-1-1">
<p>
이거 참 좀비도 아니고 puppet 이라니 
어쨌거나 사용할 수 있는(aka 읽을 수 있는) 설정 관리 툴이다
읽을 수 있다니 참 다행이다
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 정보?</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>date : 20150605
</li>
<li>written by taeyoungchoon
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 우선 무슨 일을 하던지 심볼에 대한 정리는 필요하다</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>master hostname : deb01, puppet
</li>
<li>master ip : 192.168.0.57
</li>

<li>client hostname : deb02
</li>
<li>client ip : 192.168.0.58
</li>

<li>domain name : t.com 
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> step</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> network configuration @master</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">root@deb01:~# cat /etc/resolv.conf
search t.com
nameserver 168.126.63.1
root@deb01:~# cat /etc/hosts
127.0.0.1       localhost
192.168.0.57     deb01

192.168.0.57 puppet
192.168.0.57 deb01
192.168.0.58 deb02

root@deb01:~# cat /etc/resolv.conf
search t.com
nameserver 168.126.63.1
root@deb01:~#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> network configuration @client</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">root@deb02:~# cat /etc/resolv.conf
search t.com
nameserver 168.126.63.1
root@deb02:~# cat /etc/hosts
127.0.0.1       localhost
192.168.0.58     deb02

192.168.0.57 puppet
192.168.0.57 deb01
192.168.0.58 deb02

root@deb02:~# cat /etc/resolv.conf
search t.com
nameserver 168.126.63.1
root@deb02:~#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> install puppet master app @master</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh">root@deb01:~# apt-get install puppet-maste
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> install puppet client app @client</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-sh">root@deb02:~# apt-get install puppet
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> generate recipe @master</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-sh">root@deb01:~# nano /etc/puppet/manifests/site.pp

package { "ntp":
    ensure =&gt; "installed"
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> check certificate list @master</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-sh">root@deb01:~# puppet cert list --all
+ "deb01.t.com" (SHA256) 8C:D9:A2:73:25:F8:68:39:13:68:71 (alt names: "DNS:deb01.t.com", "DNS:puppet", "DNS:puppet.t.com")
root@deb01:~#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> request about cert @client</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">

<pre class="src src-sh">root@deb02:/var/lib/puppet# puppet agent -t
Info: Creating a new SSL key for deb02.t.com
Info: csr_attributes file loading from /etc/puppet/csr_attributes.yaml
Info: Creating a new SSL certificate request for deb02.t.com
Info: Certificate Request fingerprint (SHA256): 14:80:00:FA:F0:80:31:2D:AD:CF:07
Exiting; no certificate found and waitforcert is disabled
root@deb02:/var/lib/puppet#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> accept cert @master</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-sh">root@deb01:~# puppet cert list --all
  "deb02.t.com" (SHA256) 14:80:00:FA:F0:80:31:2D:AD:CF:07
+ "deb01.t.com" (SHA256) 8C:D9:A2:73:25:F8:68:39:13:68:71 (alt names: "DNS:deb01.t.com", "DNS:puppet", "DNS:puppet.t.com")
root@deb01:~#
root@deb01:~# puppet cert sign deb02.t.com
Notice: Signed certificate request for deb02.t.com
Notice: Removing file Puppet::SSL::CertificateRequest deb02.t.com at '/var/lib/puppet/ssl/ca/requests/deb02.t.com.pem'
root@deb01:~#
root@deb01:~#
root@deb01:~# puppet cert list --all
+ "deb01.t.com" (SHA256) 8C:D9:A2:73:25:F8:68:39:13:68:71 (alt names: "DNS:deb01.t.com", "DNS:puppet", "DNS:puppet.t.com")
+ "deb02.t.com" (SHA256) FD:AA:59:60:08:FA:5E:F3:B7:6D:9E:33:CC
root@deb01:~#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> apply recipe @client</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">

<pre class="src src-sh">root@deb02:/var/lib/puppet# puppet agent -t
Info: Retrieving pluginfacts
Info: Retrieving plugin
Info: Caching catalog for deb02.t.com
Info: Applying configuration version '1433492441'
Notice: Finished catalog run in 0.04 seconds
root@deb02:/var/lib/puppet#
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> case : broken cert</h3>
<div class="outline-text-3" id="text-3-10">
<div class="org-src-container">

<pre class="src src-sh">root@deb02:/var/lib/puppet# puppet agent --test
Info: Caching certificate for deb02.t.com
Error: Could not request certificate: The certificate retrieved from the master does not match the agent's private key.
Certificate fingerprint: C2:5E:74:A7:BC:8C:9E:AD:05:EA
To fix this, remove the certificate from both the master and the agent and then start a puppet run, which will automatically regenerate a certficate.
On the master:
  puppet cert clean deb02.t.com
On the agent:
  1a. On most platforms: find /var/lib/puppet/ssl -name deb02.t.com.pem -delete
  1b. On Windows: del "/var/lib/puppet/ssl/deb02.t.com.pem" /f
  2. puppet agent -t
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> one more thing</h2>
<div class="outline-text-2" id="text-4">
<p>
cfengine
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-06-09 화 14:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
